Tekla Open API Reference for Tekla Structures 2025
BaseWeld.WeldContourEnum Enumeration
 The weld contour.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WeldContourEnum
Public Enumeration WeldContourEnum
Members
Member name | Value | Description
WELD_CONTOUR_NONE | 0 |  No contour.
WELD_CONTOUR_FLUSH | 1 |  The flush contour.
WELD_CONTOUR_CONVEX | 2 |  The convex contour.
WELD_CONTOUR_CONCAVE | 3 |  The concave contour.
See Also
Reference
Tekla.Structures.Model Namespace